docs/Blog/multilingual-support-with-ob-translate-and-google-translate.org
# Created 2025-09-25 Thu 04:00
#+title: multilingual support with ob-translate and google-translate
#+author: Christopher M. Miles
* Why multilingual support?
:PROPERTIES:
:ID:       89eb36af-621b-4cf0-8a26-fb5363523f34
:PUBDATE:  <2019-08-14 Wed 19:47>
:END:

#+begin_src translate :src auto :dest zh-CN,zh-TW,ja,ko
On the internet, English is the main language. But currently translation is good
enough now. In my previous blog posts I use two languages to write, it is take
much time. I want t a simpler automatic way to do this.
#+end_src

#+results[<2018-04-21 16:14:47> f94aff19787f76c9e0faea4cf7522a0c6259765d]: 
| zh-CN | 在互联网上，英语是主要的语言。但是现在翻译已经够好了。在我以前的博客文章中，我使用两种语言编写，这需要很长时间。我想要一个更简单的自动方式来做到这一点。                                 |
| zh-TW | 在互聯網上，英語是主要的語言。但是現在翻譯已經夠好了。在我以前的博客文章中，我使用兩種語言編寫，這需要很長時間。我想要一個更簡單的自動方式來做到這一點。                                 |
| ja    | インターネットでは、英語が主要言語です。しかし、現在のところ翻訳は十分です。以前のブログ記事では、2つの言語を使って書きましたが、時間がかかります。私はこれを行う簡単な自動方法をしたいです。 |
| ko    | 인터넷에서 영어가 주요 언어입니다. 그러나 현재 번역은 현재 충분합니다. 이전 글에서 두 언어를 사용하여 글을 쓸 때 시간이 많이 걸립니다. 이 작업을 수행하는 더 간단한 자동 방법을 원합니다.                      |
* How it looks like
:PROPERTIES:
:ID:       2a4cc1ca-603a-4bde-b514-2a54c4c8b618
:PUBDATE:  <2019-08-14 Wed 19:47>
:END:

#+begin_src org
,#+begin_src translate :src zh-CN :dest en,zh-TW,ja,ko
你好，我叫阿国。
,#+end_src

,#+RESULTS[<2018-04-21 16:17:39> 7982d9e369a56107e0b9252c5b1a7753bd6ecef0]:
| en    | Hello, my name is Aguo.              |
| zh-TW | 你好，我叫阿國。                     |
| ja    | こんにちは、私の名前はアグーオです。 |
| ko    | 안녕, 내 이름은 아구아 야.           |
#+end_src


*NOTE*: Not allow space between langs (~en,zh-TW,ja,ko~). Other wise it does not wok.
* Multilingual support setup
:PROPERTIES:
:ID:       4bf5688c-1cf9-4f8e-b029-a8cbfd05de01
:PUBDATE:  <2019-08-14 Wed 19:47>
:END:

Multilingual support is simple to integrate. Especially like great tool Emacs
and Org-mode. I remember a great tool "ob-translate" which use
"[[https://github.com/atykhonov/google-translate][google-translate]]" as backend support. Really simple to use in Org-mode
(especial I publish whole website with Org-mode org-publish).
** configure ob-translate
:PROPERTIES:
:ID:       d3438fac-e61d-41f8-89bd-a1149555d11e
:END:

My sample config here:

#+begin_src emacs-lisp
(use-package ob-translate
  :ensure t
  :init
  (add-to-list 'org-babel-load-languages '(translate . t))
  (org-babel-do-load-languages 'org-babel-load-languages org-babel-load-languages)
  ;; add translate special block into structure template alist.
  (add-to-list 'org-structure-template-alist '("t" . "src translate")))
#+end_src

I added ob-translate src block into Org-mode new structure template alist.
*** require org-mode export src blocks export with results
:PROPERTIES:
:ID:       68991e81-f2b4-43ca-a71d-b81e85ae0e07
:END:

#+begin_src emacs-lisp
(add-to-list 'org-babel-default-header-args '(:eval . "never-export"))
(add-to-list 'org-babel-default-header-args '(:exports . "both"))
#+end_src

- The first let Org-mode don't evaluate src blocks when exporting.
- The second let Org-mode export src blocks with results.
*** create a snippet for easy inserting template
:PROPERTIES:
:ID:       57f31085-c85b-4dd7-9f75-dabbbb283dc0
:END:

#+begin_src snippet
# -*- mode: snippet -*-
# name: ob-translate
# key: babel-translate
# group: babel
# expand-env: ((yas-indent-line 'fixed) (yas-wrap-around-region 't))
# --
,#+begin_src translate :src ${1:source: auto, en, zh-CN} :dest ${2:en,zh-KW,ja,ko}
$0
,#+end_src
#+end_src
