docs/Blog/multilingual-support-with-ob-translate-and-google-translate.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-09-25 Thu 04:00 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>multilingual support with ob-translate and google-translate</title>
<meta name="author" content="Christopher M. Miles" />
<meta name="generator" content="Org Mode" />
<link ref="icon" type="image/png" href="/assets/images/favicon-16x16.png" sizes="16x16"><link ref="icon" type="image/png" href="/assets/images/favicon-32x32.png" sizes="32x32"><link rel="stylesheet" type="text/css" href="/assets/stylesheets/stylesheet.css"/><link rel="stylesheet" type="text/css" href="/assets/stylesheets/syntax-highlight.css"/><link rel="alternate" type="application/rss+xml" href="https://stardiviner.github.io/Blog/index.xml">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://stardiviner.github.io/"> HOME </a>
</div><div id="preamble" class="status">
<div class='nav'>
  <ul>
    <li><a href='/'>Home</a></li>
    <li><a href='/Blog/index.html'>Blog</a></li>
    <li><a href="/Thought/index.html">Thought</a></li>
    <li><a href='/Literature/index.html'>文学</a></li>
    <li>
      <span id="animationWords">
        <a href='/About/index.html'>About</a>
      </span>
    </li>
  </ul>
</div>
<div class="epilogue">
  <p>感谢那些照顾过我的人，也谢谢那些伤害过我的人，让我成为这样一个人。</p>
</div>
</div>
<div id="content" class="content">
<header>
<h1 class="title">multilingual support with ob-translate and google-translate</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#ID-89eb36af-621b-4cf0-8a26-fb5363523f34">1. Why multilingual support?</a></li>
<li><a href="#ID-2a4cc1ca-603a-4bde-b514-2a54c4c8b618">2. How it looks like</a></li>
<li><a href="#ID-4bf5688c-1cf9-4f8e-b029-a8cbfd05de01">3. Multilingual support setup</a>
<ul>
<li><a href="#ID-d3438fac-e61d-41f8-89bd-a1149555d11e">3.1. configure ob-translate</a>
<ul>
<li><a href="#ID-68991e81-f2b4-43ca-a71d-b81e85ae0e07">3.1.1. require org-mode export src blocks export with results</a></li>
<li><a href="#ID-57f31085-c85b-4dd7-9f75-dabbbb283dc0">3.1.2. create a snippet for easy inserting template</a></li>
</ul>
</li>
<li><a href="#ID-d8651489-18df-4f7d-88f5-80d9e54fc30a">3.2. configure google-translate if you use it interactively</a></li>
<li><a href="#ID-9a201c6a-3dec-401b-9789-6dc80da8eea8">3.3. about Google Translate service not accessible issue</a></li>
</ul>
</li>
<li><a href="#ID-d8acb8d5-15e6-49fd-88a7-7baded863c4d">4. Some issues</a>
<ul>
<li><a href="#ID-d217c234-d73f-4107-9874-2b7eb5d8cd61">4.1. the Babel result output type is table</a></li>
<li><a href="#ID-35ee5b8d-9ce5-4594-8b84-0d51e904a92e">4.2. ob-translate can't be used anywhere in Org-mode buffer</a></li>
</ul>
</li>
<li><a href="#ID-62f990e7-4b7a-4101-bd5d-b3693a54a0ce">5. Any updates will updated in this post</a></li>
<li><a href="#ID-8524b659-aa14-4eca-981f-0b821a7d25aa">6. use external tools to translate with ob-shell</a>
<ul>
<li><a href="#ID-c2947e8d-c810-4431-861e-a87db6872f18">6.1. fanyi</a></li>
</ul>
</li>
</ul>
</div>
</nav>
<div id="outline-container-ID-89eb36af-621b-4cf0-8a26-fb5363523f34" class="outline-2">
<h2 id="ID-89eb36af-621b-4cf0-8a26-fb5363523f34"><span class="section-number-2">1.</span> <a href="#ID-89eb36af-621b-4cf0-8a26-fb5363523f34">Why multilingual support?</a></h2>
<div class="outline-text-2" id="text-1">
<pre class="example">
ID: 89eb36af-621b-4cf0-8a26-fb5363523f34
PUBDATE: <2019-08-14 Wed 19:47>
</pre>

<div class="org-src-container">
<pre class="src src-translate"><code><code>On the internet, English is the main language. But currently translation is good</code>
<code>enough now. In my previous blog posts I use two languages to write, it is take</code>
<code>much time. I want t a simpler automatic way to do this.</code>
</code></pre>
</div>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">zh-CN</td>
<td class="org-left">在互联网上，英语是主要的语言。但是现在翻译已经够好了。在我以前的博客文章中，我使用两种语言编写，这需要很长时间。我想要一个更简单的自动方式来做到这一点。</td>
</tr>

<tr>
<td class="org-left">zh-TW</td>
<td class="org-left">在互聯網上，英語是主要的語言。但是現在翻譯已經夠好了。在我以前的博客文章中，我使用兩種語言編寫，這需要很長時間。我想要一個更簡單的自動方式來做到這一點。</td>
</tr>

<tr>
<td class="org-left">ja</td>
<td class="org-left">インターネットでは、英語が主要言語です。しかし、現在のところ翻訳は十分です。以前のブログ記事では、2つの言語を使って書きましたが、時間がかかります。私はこれを行う簡単な自動方法をしたいです。</td>
</tr>

<tr>
<td class="org-left">ko</td>
<td class="org-left">인터넷에서 영어가 주요 언어입니다. 그러나 현재 번역은 현재 충분합니다. 이전 글에서 두 언어를 사용하여 글을 쓸 때 시간이 많이 걸립니다. 이 작업을 수행하는 더 간단한 자동 방법을 원합니다.</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-ID-2a4cc1ca-603a-4bde-b514-2a54c4c8b618" class="outline-2">
<h2 id="ID-2a4cc1ca-603a-4bde-b514-2a54c4c8b618"><span class="section-number-2">2.</span> <a href="#ID-2a4cc1ca-603a-4bde-b514-2a54c4c8b618">How it looks like</a></h2>
<div class="outline-text-2" id="text-2">
<pre class="example">
ID: 2a4cc1ca-603a-4bde-b514-2a54c4c8b618
PUBDATE: <2019-08-14 Wed 19:47>
</pre>

<div class="org-src-container">
<pre class="src src-org"><code><code><span style="color: #676E95; background-color: #232635;">&#60100; translate :src zh-CN :dest en,zh-TW,ja,ko</code>
<code></span><span style="background-color: #3C435E;">&#20320;&#22909;&#65292;&#25105;&#21483;&#38463;&#22269;&#12290;</code>
<code>&#986659;</span><span style="color: #676E95; background-color: #232635;"></code>
<code></span><span style="color: #89DDFF; font-weight: bold; font-style: italic;"></code>
<code></span><span style="color: #8d92af;">#+RESULTS[ </span><span style="color: #ffffff; background-color: #333333; font-size: 80%;">2018-04-21 </span><span style="color: #000000; background-color: #bfbfbf; font-size: 80%;"> 16:17:39 </span><span style="color: #8d92af;"> 7982d9e369a56107e0b9252c5b1a7753bd6ecef0]:</span><span style="color: #89DDFF; font-weight: bold; font-style: italic;"></code>
<code>|</span><span style="color: #82aaff;"> en    | Hello, my name is Aguo.              |</span><span style="color: #82aaff;"></code>
<code>|</span><span style="color: #82aaff;"> zh-TW | &#20320;&#22909;&#65292;&#25105;&#21483;&#38463;&#22283;&#12290;                     |</span><span style="color: #82aaff;"></code>
<code>|</span><span style="color: #82aaff;"> ja    | &#12371;&#12435;&#12395;&#12385;&#12399;&#12289;&#31169;&#12398;&#21517;&#21069;&#12399;&#12450;&#12464;&#12540;&#12458;&#12391;&#12377;&#12290; |</span><span style="color: #82aaff;"></code>
<code>|</span><span style="color: #82aaff;"> ko    | &#50504;&#45397;, &#45236; &#51060;&#47492;&#51008; &#50500;&#44396;&#50500; &#50556;.           |</span></code>
</code></pre>
</div>


<p>
<b>NOTE</b>: Not allow space between langs (<code>en,zh-TW,ja,ko</code>). Other wise it does not wok.
</p>
</div>
</div>
<div id="outline-container-ID-4bf5688c-1cf9-4f8e-b029-a8cbfd05de01" class="outline-2">
<h2 id="ID-4bf5688c-1cf9-4f8e-b029-a8cbfd05de01"><span class="section-number-2">3.</span> <a href="#ID-4bf5688c-1cf9-4f8e-b029-a8cbfd05de01">Multilingual support setup</a></h2>
<div class="outline-text-2" id="text-3">
<pre class="example">
ID: 4bf5688c-1cf9-4f8e-b029-a8cbfd05de01
PUBDATE: <2019-08-14 Wed 19:47>
</pre>

<p>
Multilingual support is simple to integrate. Especially like great tool Emacs
and Org-mode. I remember a great tool "ob-translate" which use
"<a href="https://github.com/atykhonov/google-translate">google-translate</a>" as backend support. Really simple to use in Org-mode
(especial I publish whole website with Org-mode org-publish).
</p>
</div>
<div id="outline-container-ID-d3438fac-e61d-41f8-89bd-a1149555d11e" class="outline-3">
<h3 id="ID-d3438fac-e61d-41f8-89bd-a1149555d11e"><span class="section-number-3">3.1.</span> <a href="#ID-d3438fac-e61d-41f8-89bd-a1149555d11e">configure ob-translate</a></h3>
<div class="outline-text-3" id="text-3-1">
<pre class="example">
ID: d3438fac-e61d-41f8-89bd-a1149555d11e
</pre>

<p>
My sample config here:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><code><code><span style="color: #c792ea;">(</span><span style="color: #89DDFF; font-weight: bold; font-style: italic;">use-package</span> ob-translate</code>
<code>  <span style="color: #82aaff;">:ensure</span> t</code>
<code>  <span style="color: #82aaff;">:init</span></code>
<code>  <span style="color: #f78c6c;">(</span>add-to-list 'org-babel-load-languages '<span style="color: #c3e88d;">(</span>translate . t<span style="color: #c3e88d;">)</span><span style="color: #f78c6c;">)</span></code>
<code>  <span style="color: #f78c6c;">(</span>org-babel-do-load-languages 'org-babel-load-languages org-babel-load-languages<span style="color: #f78c6c;">)</span></code>
<code>  <span style="color: #676E95;">;; </span><span style="color: #676E95;">add translate special block into structure template alist.</code>
<code></span>  <span style="color: #f78c6c;">(</span>add-to-list 'org-structure-template-alist '<span style="color: #c3e88d;">(</span><span style="color: #c3e88d;">"t"</span> . <span style="color: #c3e88d;">"src translate"</span><span style="color: #c3e88d;">)</span><span style="color: #f78c6c;">)</span><span style="color: #c792ea;">)</span></code>
</code></pre>
</div>

<p>
I added ob-translate src block into Org-mode new structure template alist.
</p>
</div>
<div id="outline-container-ID-68991e81-f2b4-43ca-a71d-b81e85ae0e07" class="outline-4">
<h4 id="ID-68991e81-f2b4-43ca-a71d-b81e85ae0e07"><span class="section-number-4">3.1.1.</span> <a href="#ID-68991e81-f2b4-43ca-a71d-b81e85ae0e07">require org-mode export src blocks export with results</a></h4>
<div class="outline-text-4" id="text-3-1-1">
<pre class="example">
ID: 68991e81-f2b4-43ca-a71d-b81e85ae0e07
</pre>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><code><code><span style="color: #c792ea;">(</span>add-to-list 'org-babel-default-header-args '<span style="color: #f78c6c;">(</span><span style="color: #82aaff;">:eval</span> . <span style="color: #c3e88d;">"never-export"</span><span style="color: #f78c6c;">)</span><span style="color: #c792ea;">)</span></code>
<code><span style="color: #c792ea;">(</span>add-to-list 'org-babel-default-header-args '<span style="color: #f78c6c;">(</span><span style="color: #82aaff;">:exports</span> . <span style="color: #c3e88d;">"both"</span><span style="color: #f78c6c;">)</span><span style="color: #c792ea;">)</span></code>
</code></pre>
</div>

<ul class="org-ul">
<li>The first let Org-mode don't evaluate src blocks when exporting.</li>
<li>The second let Org-mode export src blocks with results.</li>
</ul>
</div>
</div>
<div id="outline-container-ID-57f31085-c85b-4dd7-9f75-dabbbb283dc0" class="outline-4">
<h4 id="ID-57f31085-c85b-4dd7-9f75-dabbbb283dc0"><span class="section-number-4">3.1.2.</span> <a href="#ID-57f31085-c85b-4dd7-9f75-dabbbb283dc0">create a snippet for easy inserting template</a></h4>
<div class="outline-text-4" id="text-3-1-2">
<pre class="example">
ID: 57f31085-c85b-4dd7-9f75-dabbbb283dc0
</pre>

<div class="org-src-container">
<pre class="src src-snippet"><code><code><span style="color: #676E95;"># -*- mode: snippet -*-</span></code>
<code><span style="color: #676E95;"># name: ob-translate</span></code>
<code><span style="color: #676E95;"># key: babel-translate</span></code>
<code><span style="color: #676E95;"># group: babel</span></code>
<code><span style="color: #676E95;"># expand-env: ((yas-indent-line 'fixed) (yas-wrap-around-region 't))</span></code>
<code><span style="color: #676E95;"># --</span></code>
<code><span style="color: #676E95;">#+begin_src translate :src ${</span><span style="color: #ffcb6b;">1</span><span style="color: #676E95;">:source: auto, en, zh-CN} :dest ${</span><span style="color: #ffcb6b;">2</span><span style="color: #676E95;">:en,zh-KW,ja,ko}</span></code>
<code><span style="color: #89DDFF; font-weight: bold; font-style: italic;">$</span><span style="color: #c3e88d;">0</span></code>
<code><span style="color: #676E95;">#+end_src</span></code>
</code></pre>
</div>
</div>
</div>
</div>
