docs/Blog/multilingual-support-with-ob-translate-and-google-translate.html
<div id="outline-container-ID-d8651489-18df-4f7d-88f5-80d9e54fc30a" class="outline-3">
<h3 id="ID-d8651489-18df-4f7d-88f5-80d9e54fc30a"><span class="section-number-3">3.2.</span> <a href="#ID-d8651489-18df-4f7d-88f5-80d9e54fc30a">configure google-translate if you use it interactively</a></h3>
<div class="outline-text-3" id="text-3-2">
<pre class="example">
ID: d8651489-18df-4f7d-88f5-80d9e54fc30a
</pre>

<p>
Here is my config example:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><code><code><span style="color: #c792ea;">(</span><span style="color: #89DDFF; font-weight: bold; font-style: italic;">use-package</span> google-translate</code>
<code>  <span style="color: #82aaff;">:ensure</span> t</code>
<code>  <span style="color: #82aaff;">:defer</span> t</code>
<code>  <span style="color: #82aaff;">:bind</span> <span style="color: #f78c6c;">(</span><span style="color: #82aaff;">:map</span> dictionary-prefix</code>
<code>              <span style="color: #c3e88d;">(</span><span style="color: #c3e88d;">"t"</span> . google-translate-smooth-translate<span style="color: #c3e88d;">)</span></code>
<code>              <span style="color: #c3e88d;">(</span><span style="color: #c3e88d;">"C-t"</span> . google-translate-at-point<span style="color: #c3e88d;">)</span></code>
<code>              <span style="color: #c3e88d;">(</span><span style="color: #c3e88d;">"M-t"</span> . google-translate-query-translate<span style="color: #c3e88d;">)</span></code>
<code>              <span style="color: #c3e88d;">(</span><span style="color: #c3e88d;">"C-r"</span> . google-translate-at-point-reverse<span style="color: #c3e88d;">)</span></code>
<code>              <span style="color: #c3e88d;">(</span><span style="color: #c3e88d;">"M-r"</span> . google-translate-query-translate-reverse<span style="color: #c3e88d;">)</span><span style="color: #f78c6c;">)</span></code>
<code>  <span style="color: #82aaff;">:init</span></code>
<code>  <span style="color: #f78c6c;">(</span>add-to-list 'display-buffer-alist</code>
<code>               '<span style="color: #c3e88d;">(</span><span style="color: #c3e88d;">"^\\*Google Translate\\*"</span> . <span style="color: #89DDFF;">(</span>display-buffer-below-selected<span style="color: #89DDFF;">)</span><span style="color: #c3e88d;">)</span><span style="color: #f78c6c;">)</span></code>
<code>  <span style="color: #82aaff;">:config</span></code>
<code>  <span style="color: #f78c6c;">(</span><span style="color: #89DDFF; font-weight: bold; font-style: italic;">setq</span> google-translate-enable-ido-completion nil</code>
<code>        google-translate-show-phonetic t</code>
<code>        <span style="color: #676E95;">;; </span><span style="color: #676E95;">google-translate-listen-program</code>
<code></span>        google-translate-output-destination nil <span style="color: #676E95;">; </span><span style="color: #676E95;">'echo-area, 'popup</code>
<code></span>        google-translate-pop-up-buffer-set-focus t</code>
<code>        <span style="color: #676E95;">;; </span><span style="color: #676E95;">`</span><span style="color: #f78c6c;">google-translate-supported-languages</span><span style="color: #676E95;">'</code>
<code></span>        google-translate-default-target-language <span style="color: #c3e88d;">"zh-CN"</span></code>
<code>        <span style="color: #676E95;">;; </span><span style="color: #676E95;">for `</span><span style="color: #f78c6c;">google-translate-smooth-translate</span><span style="color: #676E95;">' + [C-n/p]</code>
<code></span>        google-translate-translation-directions-alist '<span style="color: #c3e88d;">(</span><span style="color: #89DDFF;">(</span><span style="color: #c3e88d;">"en"</span> . <span style="color: #c3e88d;">"zh-CN"</span><span style="color: #89DDFF;">)</span></code>
<code>                                                        <span style="color: #89DDFF;">(</span><span style="color: #c3e88d;">"zh-CN"</span> . <span style="color: #c3e88d;">"en"</span><span style="color: #89DDFF;">)</span></code>
<code>                                                        <span style="color: #89DDFF;">(</span><span style="color: #c3e88d;">"zh-CN"</span> . <span style="color: #c3e88d;">"ja"</span><span style="color: #89DDFF;">)</span></code>
<code>                                                        <span style="color: #89DDFF;">(</span><span style="color: #c3e88d;">"zh-CN"</span> . <span style="color: #c3e88d;">"ko"</span><span style="color: #89DDFF;">)</span><span style="color: #c3e88d;">)</span></code>
<code>        <span style="color: #f78c6c;">)</span><span style="color: #c792ea;">)</span></code>
</code></pre>
</div>

<p>
You should explore google-translate features on its readme page, really convinient.
</p>
</div>
</div>
<div id="outline-container-ID-9a201c6a-3dec-401b-9789-6dc80da8eea8" class="outline-3">
<h3 id="ID-9a201c6a-3dec-401b-9789-6dc80da8eea8"><span class="section-number-3">3.3.</span> <a href="#ID-9a201c6a-3dec-401b-9789-6dc80da8eea8">about Google Translate service not accessible issue</a></h3>
<div class="outline-text-3" id="text-3-3">
<pre class="example">
ID: 9a201c6a-3dec-401b-9789-6dc80da8eea8
</pre>

<p>
I'm writing a simple global minor mode to toggle proxy (support HTTP, socks)
from inside of Emacs, instead of system global.
</p>

<p>
For now, you can simply use my helper function:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><code><code><span style="color: #c792ea;">(</span><span style="color: #89DDFF; font-weight: bold; font-style: italic;">defvar</span> <span style="color: #ffcb6b;">my:proxy-toggle-p</span> nil</code>
<code>  <span style="color: #8d92af;">"A global variable indicate current proxy toggle status.</code>
<code>Used by function `</span><span style="color: #f78c6c;">my:proxy-toggle</span><span style="color: #8d92af;">'."</span><span style="color: #c792ea;">)</span></code>
<code></code>
<code><span style="color: #c792ea;">(</span><span style="color: #89DDFF; font-weight: bold; font-style: italic;">defun</span> <span style="color: #82aaff;">my:proxy-toggle</span> <span style="color: #f78c6c;">(</span>proxy<span style="color: #f78c6c;">)</span></code>
<code>  <span style="color: #8d92af;">"A command to toggle `</span><span style="color: #f78c6c;">PROXY</span><span style="color: #8d92af;">' for Emacs."</span></code>
<code>  <span style="color: #f78c6c;">(</span><span style="color: #89DDFF; font-weight: bold; font-style: italic;">interactive</span> <span style="color: #c3e88d;">(</span>list <span style="color: #89DDFF;">(</span><span style="color: #89DDFF; font-weight: bold; font-style: italic;">unless</span> my:proxy-toggle-p</code>
<code>                       <span style="color: #bb80b3;">(</span>completing-read <span style="color: #c3e88d;">"Select a proxy routine: "</span> '<span style="color: #ffcb6b;">(</span><span style="color: #c3e88d;">"socks"</span> <span style="color: #c3e88d;">"url_proxy_services"</span> <span style="color: #c3e88d;">"env HTTP_PROXY"</span><span style="color: #ffcb6b;">)</span><span style="color: #bb80b3;">)</span><span style="color: #89DDFF;">)</span><span style="color: #c3e88d;">)</span><span style="color: #f78c6c;">)</span></code>
<code>  <span style="color: #f78c6c;">(</span><span style="color: #89DDFF; font-weight: bold; font-style: italic;">if</span> my:proxy-toggle-p</code>
<code>      <span style="color: #c3e88d;">(</span><span style="color: #89DDFF; font-weight: bold; font-style: italic;">setq</span> my:proxy-toggle-p nil<span style="color: #c3e88d;">)</span></code>
<code>    <span style="color: #c3e88d;">(</span><span style="color: #89DDFF; font-weight: bold; font-style: italic;">setq</span> my:proxy-toggle-p proxy<span style="color: #c3e88d;">)</span><span style="color: #f78c6c;">)</span></code>
<code>  <span style="color: #f78c6c;">(</span><span style="color: #89DDFF; font-weight: bold; font-style: italic;">pcase</span> my:proxy-toggle-p</code>
<code>    <span style="color: #c3e88d;">(</span><span style="color: #c3e88d;">"socks"</span></code>
<code>     <span style="color: #89DDFF;">(</span><span style="color: #89DDFF; font-weight: bold; font-style: italic;">setq</span> url-gateway-method 'socks</code>
<code>           socks-noproxy '<span style="color: #bb80b3;">(</span><span style="color: #c3e88d;">"localhost"</span><span style="color: #bb80b3;">)</span></code>
<code>           socks-server '<span style="color: #bb80b3;">(</span><span style="color: #c3e88d;">"Default server"</span> <span style="color: #c3e88d;">"127.0.0.1"</span> 1086 5<span style="color: #bb80b3;">)</span><span style="color: #89DDFF;">)</span><span style="color: #c3e88d;">)</span></code>
<code>    <span style="color: #c3e88d;">(</span><span style="color: #c3e88d;">"url_proxy_services"</span></code>
<code>     <span style="color: #89DDFF;">(</span><span style="color: #89DDFF; font-weight: bold; font-style: italic;">setq</span> url-proxy-services</code>
<code>           '<span style="color: #bb80b3;">(</span><span style="color: #ffcb6b;">(</span><span style="color: #c3e88d;">"http"</span>  . <span style="color: #c3e88d;">"127.0.0.1:8118"</span><span style="color: #ffcb6b;">)</span></code>
<code>             <span style="color: #ffcb6b;">(</span><span style="color: #c3e88d;">"https"</span> . <span style="color: #c3e88d;">"127.0.0.1:8118"</span><span style="color: #ffcb6b;">)</span></code>
<code>             <span style="color: #ffcb6b;">(</span><span style="color: #c3e88d;">"ftp"</span>   . <span style="color: #c3e88d;">"127.0.0.1:8118"</span><span style="color: #ffcb6b;">)</span></code>
<code>             <span style="color: #676E95;">;; </span><span style="color: #676E95;">don't use `</span><span style="color: #f78c6c;">localhost</span><span style="color: #676E95;">', avoid robe server (For Ruby) can't response.</code>
<code></span>             <span style="color: #ffcb6b;">(</span><span style="color: #c3e88d;">"no_proxy"</span> . <span style="color: #c3e88d;">"127.0.0.1"</span><span style="color: #ffcb6b;">)</span></code>
<code>             <span style="color: #ffcb6b;">(</span><span style="color: #c3e88d;">"no_proxy"</span> . <span style="color: #c3e88d;">"^.*</span><span style="color: #89DDFF; font-weight: bold;">\\</span><span style="color: #89DDFF; font-weight: bold;">(</span><span style="color: #c3e88d;">baidu</span><span style="color: #89DDFF; font-weight: bold;">\\</span><span style="color: #89DDFF; font-weight: bold;">|</span><span style="color: #c3e88d;">sina)\\.com"</span><span style="color: #ffcb6b;">)</span></code>
<code>             <span style="color: #bb80b3;">)</span><span style="color: #89DDFF;">)</span><span style="color: #c3e88d;">)</span></code>
<code>    <span style="color: #c3e88d;">(</span><span style="color: #c3e88d;">"env HTTP_PROXY"</span></code>
<code>     <span style="color: #676E95;">;; </span><span style="color: #676E95;">Privoxy</code>
<code></span>     <span style="color: #89DDFF;">(</span>setenv <span style="color: #c3e88d;">"HTTP_PROXY"</span>  <span style="color: #c3e88d;">"http://localhost:8118"</span><span style="color: #89DDFF;">)</span></code>
<code>     <span style="color: #89DDFF;">(</span>setenv <span style="color: #c3e88d;">"HTTPS_PROXY"</span> <span style="color: #c3e88d;">"http://localhost:8118"</span><span style="color: #89DDFF;">)</span><span style="color: #c3e88d;">)</span></code>
<code>    <span style="color: #c3e88d;">(</span>_</code>
<code>     <span style="color: #89DDFF;">(</span><span style="color: #89DDFF; font-weight: bold; font-style: italic;">setq</span> url-gateway-method 'native<span style="color: #89DDFF;">)</span></code>
<code>     <span style="color: #89DDFF;">(</span><span style="color: #89DDFF; font-weight: bold; font-style: italic;">setq</span> url-proxy-services nil<span style="color: #89DDFF;">)</span></code>
<code>     <span style="color: #89DDFF;">(</span>setenv <span style="color: #c3e88d;">"HTTP_PROXY"</span>  nil<span style="color: #89DDFF;">)</span></code>
<code>     <span style="color: #89DDFF;">(</span>setenv <span style="color: #c3e88d;">"HTTPS_PROXY"</span> nil<span style="color: #89DDFF;">)</span><span style="color: #c3e88d;">)</span></code>
<code>    <span style="color: #f78c6c;">)</span><span style="color: #c792ea;">)</span></code>
</code></pre>
</div>
</div>
</div>
</div>
<div id="outline-container-ID-d8acb8d5-15e6-49fd-88a7-7baded863c4d" class="outline-2">
<h2 id="ID-d8acb8d5-15e6-49fd-88a7-7baded863c4d"><span class="section-number-2">4.</span> <a href="#ID-d8acb8d5-15e6-49fd-88a7-7baded863c4d">Some issues</a></h2>
<div class="outline-text-2" id="text-4">
<pre class="example">
ID: d8acb8d5-15e6-49fd-88a7-7baded863c4d
PUBDATE: <2019-08-14 Wed 19:47>
</pre>
</div>
